---
layout:  post
title:   Lab 4
tagline: Advanced functions (HOF, composition, lambdas) and pairs

exercises: https://www.dropbox.com/sh/l0mnvwgk0mayvuz/AAC8ilUqIyAK2zJcld9ifU9aa?dl=0
optional:  https://www.dropbox.com/sh/h8e14a9eqa8qid9/AAAVNdBL-8moe0iNkeRIVN05a?dl=0
---
# Higher order functions

Functions that take other functions as arguments:

```haskell
> double x = x + x
> map double [1, 2, 3]  -- apply the function to each element in the list
[2, 4, 6]

> isDivisible x = x `mod` 3 == 0
> filter isDivisible [1, 2, 3, 4, 5, 6]  -- only keep elements where the function returns True
[3, 6]

> customAdd x y = x + y + 10
> foldl customAdd 100 [1, 2, 3]  -- aggeregate elements with the given function starting with the initial value
136   -- 100(initial) + 1(first element) +10(from customAdd)   +   2 +10   +   3 +10
```

This way, the functions defined in [Lab 2](/lab2) can be rewritten as:

```haskell
> square x = x^2  -- x^2 is equivalent to x*x

> squares l = map square l
> squares [1, 2, 3, 4]
[1, 4, 9, 16]

> squareEvens l = map square (filter even l)
> squareEvens [4, 16]
```



# Function composition

The following definitions are equivalent:

```haskell
compound x = double(add5 (x))
compound x = (double . add5) x
compound x = double . add5 $ x  -- different way, less parentheses
compound = double . add  -- ommit the argument all-together

> compound 10
30  -- add5 (becomes 15) then double (becomes 30)
```

This way, the above can be rewritten as:

```haskell
squares = map square
squareEvens = map square . filter even
```



# Lambdas and short-hands

A lambda is an anonymous function, the following are all equivalent:

```haskell
> map double [1, 2, 3]
> map (\x -> x * 2) [1, 2, 3]  -- because \ kind-of looks like a little lambda
> map (*2) [1, 2, 3]  -- currying (more in later labs)

[1, 4, 9]  -- all three yield the same thing
```

This way, the above can be rewritten as:

```haskell
square = (^2)
squares = map (^2)
squareEvens = map (^2) . filter even
```



# Pairs

A pair looks like `(a, b)`

```haskell
> fst (1, 2)  -- access first element
1

> snd (1, 2)  -- access second element
2
```



 `uncurry` transforms a function that takes *two arguments* into one that takes *a pair*

```haskell
> customAdd 2 3
15 -- 2 + 3 + 10

> pairwise = uncurry customAdd
> pairwise (2, 3)
15

> uncurry (-) 10 7  -- also works for operators
3
```



 `zip` creates pairs of elements from given lists:

```haskell
> :t zip
zip :: [a] -> [b] -> [(a, b)]

> [1, 2, 3] `zip` [0, 0, 7]
[(1,0), (2,0), (3,7)]

> zip "abc" [0..]  -- with an infinite list
[('a',0), ('b',1), ('c',2)]
```
