---
layout:  post
title:   Lab 6
tagline: Nothing, Either, exporting and polymorphism

exercises: https://www.dropbox.com/sh/bp72mjm2b223xt0/AAD6jl6tM5X30XgidrrNuHHLa?dl=1
optional:  https://www.dropbox.com/sh/6gk8xizdcz6svc1/AAB5YhEDV882HEyRukXxDM_wa?dl=1
---
# Maybe

Denotes an *optional* result

```haskell
data Maybe a = Nothing | Just a
```

For an operation that can *fail*

```haskell
divide :: [Int] -> Int -> Maybe Int
divide n 0 = Nothing  -- can't divide by zero, fail
divide n m = Just (n `div` m)  -- successful division
```

Or as an optional argument

```haskell
power :: Maybe Int -> Int -> Int
power (Just b) e = b^e  -- extract the base from the optional datatype
power Nothing e  = 2^e  -- use base 2 if none specified
```



# Either

Mutual exclusion of two elements

```haskell
data Either a b = Left a | Right b
```

Possibly of two different types (`Int` and `String`)

```haskell
test_results :: [Either Int String]  -- either got a grade, or something happened
test_results = [Left 5, Left 10, Right "absent", Left 7, Right "cheated"]
```

Using them

```haskell
anyone_absent :: [Either Int String] -> Bool
anyone_absent (Right s : xs) = (s == "absent") || anyone_absent xs  -- check what happened
anyone_absent (Left i : xs) = anyone_absent xs  -- just skip grades
```



# Exporting

Enables abstraction through modules.

In one file  we define a secret encryption, exporting only `encrypt` and `key_size`:

```haskell
module SecretModule (encrypt, key_size) where
key = 4321  -- not exported
key_size = 4
encrypt x = x `mod` key
```

In another file, or in `ghci`, we use the defined variables

```haskell
import SecretModule   -- import everything this module exports

> key_size
4

> encrypt 5578
1257

> key  -- not exported
<error> "Variable not in scope"
```

Import only some variables

```haskell
import SecretModule (encrypt)  -- import ONLY the encryption function
import SecretModule hiding (key_size) -- import everything EXCEPT the key size; useful in avoiding name clashes
```



# Polymorphism

The `+` operator works on both `Int` and `Double` objects, returning the appropriate type.

```haskell
> 1 + 2
3  -- an Int

> 1.5 + 0.5
2.0  -- a Double
```

From its signature we can tell that it takes two objects of any type, `a`, and returns one of the same kind. It has the added constraint that this type must be numeric, `Num a =>`.

```haskell
> :t (+)  -- consult the signature
(+) :: Num a => a -> a -> a
```

Other examples include the equality operator `=`, the inclusion function, `elem`, etc.



Writing your own polymorphic functions requires no additional setup â€” just don't write a specific data type in the function signature. Convention dictates that their type should be named `a` (short for anything).